; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	instrument3 - instrument
	satellite3 - satellite
	instrument4 - instrument
	instrument5 - instrument
	satellite4 - satellite
	instrument6 - instrument
	instrument7 - instrument
	infrared3 - mode
	infrared1 - mode
	spectrograph0 - mode
	spectrograph2 - mode
	image4 - mode
	GroundStation0 - direction
	GroundStation5 - direction
	Star4 - direction
	Star2 - direction
	GroundStation6 - direction
	GroundStation3 - direction
	GroundStation1 - direction
	Star7 - direction
	Planet8 - direction
	Planet9 - direction
	Phenomenon10 - direction
	Star11 - direction
	Phenomenon12 - direction
	Phenomenon13 - direction
)
(:init
	(supports instrument0 infrared3)
	(calibration_target instrument0 GroundStation6)
	(calibration_target instrument0 Star4)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation6)
	(supports instrument1 infrared3)
	(supports instrument1 spectrograph0)
	(supports instrument1 image4)
	(calibration_target instrument1 GroundStation6)
	(calibration_target instrument1 GroundStation1)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet8)
	(supports instrument2 infrared3)
	(calibration_target instrument2 Star4)
	(supports instrument3 spectrograph2)
	(calibration_target instrument3 GroundStation1)
	(on_board instrument2 satellite2)
	(on_board instrument3 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon10)
	(supports instrument4 infrared3)
	(supports instrument4 image4)
	(supports instrument4 spectrograph2)
	(calibration_target instrument4 GroundStation1)
	(supports instrument5 spectrograph0)
	(supports instrument5 infrared1)
	(calibration_target instrument5 Star2)
	(calibration_target instrument5 Star4)
	(on_board instrument4 satellite3)
	(on_board instrument5 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star2)
	(supports instrument6 infrared1)
	(supports instrument6 spectrograph0)
	(calibration_target instrument6 GroundStation3)
	(calibration_target instrument6 GroundStation6)
	(supports instrument7 infrared1)
	(calibration_target instrument7 GroundStation1)
	(on_board instrument6 satellite4)
	(on_board instrument7 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Phenomenon12)
)
(:goal (and
	(pointing satellite0 Planet9)
	(pointing satellite3 GroundStation6)
	(have_image Star7 infrared1)
	(have_image Planet8 infrared3)
	(have_image Planet9 image4)
	(have_image Phenomenon10 spectrograph0)
	(have_image Star11 infrared3)
	(have_image Phenomenon12 spectrograph2)
	(have_image Phenomenon13 spectrograph2)
))

)

; plan
1. (turn_to satellite4 groundstation3 phenomenon12)
   deleted: (pointing satellite4 phenomenon12)
   added: (pointing satellite4 groundstation3)
   goals met: 0 of 9
2. (turn_to satellite3 groundstation1 star2)
   deleted: (pointing satellite3 star2)
   added: (pointing satellite3 groundstation1)
   goals met: 0 of 9
3. (switch_on instrument4 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument4)
   goals met: 0 of 9
4. (calibrate satellite3 instrument4 groundstation1)
   added: (calibrated instrument4)
   goals met: 0 of 9
5. (turn_to satellite3 planet8 groundstation1)
   deleted: (pointing satellite3 groundstation1)
   added: (pointing satellite3 planet8)
   goals met: 0 of 9
6. (take_image satellite3 planet8 instrument4 infrared3)
   added: (have_image planet8 infrared3)
   goals met: 1 of 9
7. (turn_to satellite3 phenomenon13 planet8)
   deleted: (pointing satellite3 planet8)
   added: (pointing satellite3 phenomenon13)
   goals met: 1 of 9
8. (take_image satellite3 phenomenon13 instrument4 spectrograph2)
   added: (have_image phenomenon13 spectrograph2)
   goals met: 2 of 9
9. (turn_to satellite3 phenomenon12 phenomenon13)
   deleted: (pointing satellite3 phenomenon13)
   added: (pointing satellite3 phenomenon12)
   goals met: 2 of 9
10. (take_image satellite3 phenomenon12 instrument4 spectrograph2)
   added: (have_image phenomenon12 spectrograph2)
   goals met: 3 of 9
11. (switch_on instrument6 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument6)
   goals met: 3 of 9
12. (calibrate satellite4 instrument6 groundstation3)
   added: (calibrated instrument6)
   goals met: 3 of 9
13. (turn_to satellite0 planet9 groundstation6)
   deleted: (pointing satellite0 groundstation6)
   added: (pointing satellite0 planet9)
   goals met: 4 of 9
14. (turn_to satellite3 planet9 phenomenon12)
   deleted: (pointing satellite3 phenomenon12)
   added: (pointing satellite3 planet9)
   goals met: 4 of 9
15. (take_image satellite3 planet9 instrument4 image4)
   added: (have_image planet9 image4)
   goals met: 5 of 9
16. (turn_to satellite3 star11 planet9)
   deleted: (pointing satellite3 planet9)
   added: (pointing satellite3 star11)
   goals met: 5 of 9
17. (take_image satellite3 star11 instrument4 infrared3)
   added: (have_image star11 infrared3)
   goals met: 6 of 9
18. (turn_to satellite3 groundstation6 star11)
   deleted: (pointing satellite3 star11)
   added: (pointing satellite3 groundstation6)
   goals met: 7 of 9
19. (turn_to satellite4 phenomenon10 groundstation3)
   deleted: (pointing satellite4 groundstation3)
   added: (pointing satellite4 phenomenon10)
   goals met: 7 of 9
20. (take_image satellite4 phenomenon10 instrument6 spectrograph0)
   added: (have_image phenomenon10 spectrograph0)
   goals met: 8 of 9
21. (turn_to satellite4 star7 phenomenon10)
   deleted: (pointing satellite4 phenomenon10)
   added: (pointing satellite4 star7)
   goals met: 8 of 9
22. (take_image satellite4 star7 instrument6 infrared1)
   added: (have_image star7 infrared1)
   goals met: 9 of 9
